In [2]:
import pandas as pd
df=pd.read_csv("dataset.csv")
df.head()

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
0,01/02/2009 6:17,Product1,1200,Mastercard,carolina,Basildon,England,United Kingdom,01/02/2009 6:00,01/02/2009 6:08,51.500000,-1.116667
1,01/02/2009 4:53,Product1,1200,Visa,Betina,Parkville,MO,United States,01/02/2009 4:42,01/02/2009 7:49,39.195000,-94.681940
2,01/02/2009 13:08,Product1,1200,Mastercard,Federica e Andrea,Astoria,OR,United States,01/01/2009 16:21,01/03/2009 12:32,46.188060,-123.830000
3,01/03/2009 14:44,Product1,1200,Visa,Gouya,Echuca,Victoria,Australia,09/25/2005 21:13,01/03/2009 14:22,-36.133333,144.750000
4,01/04/2009 12:56,Product2,3600,Visa,Gerd W,Cahaba Heights,AL,United States,11/15/2008 15:47,01/04/2009 12:45,33.520560,-86.802500

In [3]:
## Removing space from City column
df['Name']=df['Name'].str.capitalize()
df['City']=df['City'].map(lambda x: x.rstrip(' ') )
df['City']=df['City'].map(lambda x: x.lstrip(''))

In [4]:
 Which product was most sold?
print(df['Product'].value_counts())

Object `sold` not found.
Product1     847
Product2     136
Product3      14
Product3       1
Name: Product, dtype: int64

In [5]:
What payment modes were used for purchasing products?
payment_method = df['Payment_Type'].unique()
print('\nThe payment modes used for purchasing products:')
for i in range(len(payment_method)):
    print(payment_method[i])
print('\n')

Object `products` not found.

The payment modes used for purchasing products:
Mastercard
Visa
Diners
Amex

In [6]:
What is the most common payment method for the United States?
print(df.groupby('Country')['Payment_Type'].value_counts().tail(4))

Object `States` not found.
Country        Payment_Type
United States  Visa            226
               Mastercard      131
               Amex             72
               Diners           34
Name: Payment_Type, dtype: int64

In [7]:
What was the earliest time of the day a transaction occurred?
df['Transaction_date'] = pd.to_datetime(df['Transaction_date'])
sorted_date = df.sort_values('Transaction_date')
earliest_time = sorted_date[~sorted_date['Transaction_date'].dt.date.duplicated()]
print(earliest_time['Transaction_date'])

Object `occurred` not found.
54    2009-01-01 01:26:00
127   2009-01-02 00:50:00
230   2009-01-03 06:41:00
15    2009-01-04 01:05:00
60    2009-01-05 00:31:00
51    2009-01-06 01:20:00
64    2009-01-07 00:12:00
402   2009-01-08 00:04:00
306   2009-01-09 01:12:00
702   2009-01-10 00:04:00
900   2009-01-11 00:15:00
650   2009-01-12 00:17:00
513   2009-01-13 01:46:00
774   2009-01-14 00:03:00
257   2009-01-15 01:41:00
235   2009-01-16 01:07:00
146   2009-01-17 01:23:00
685   2009-01-18 00:41:00
746   2009-01-19 01:52:00
850   2009-01-20 02:17:00
880   2009-01-21 02:07:00
777   2009-01-22 02:16:00
242   2009-01-23 03:30:00
834   2009-01-24 01:22:00
265   2009-01-25 00:09:00
903   2009-01-26 01:14:00
313   2009-01-27 02:26:00
708   2009-01-28 00:22:00
733   2009-01-29 01:01:00
861   2009-01-30 01:09:00
823   2009-01-31 01:59:00
Name: Transaction_date, dtype: datetime64[ns]